TimoEngelmann/nucleo-h753zi-threadx-demo/STM32Project/Application/application.cpp
//======================================================================================================================
// MARK: Helper
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief   Converts milliseconds to timer ticks.
/// \details This function converts a duration in milliseconds to the equivalent duration in timer ticks.
///          Template parameter T specifies the return type (e.g., ULONG, uint32_t, uint16_t).
/// --------------------------------------------------------------------------------------------------------------------
template <typename T = uint32_t>
static inline T millisToTicks(T millis)
{
    constexpr uint64_t millisPerSec = 1000;
    if (millis == 0)
    {
        return static_cast<T>(0); // NOLINT(readability-braces-around-statements)
    }
    // Integer ceil-Division: (a + b - 1) / b
    uint64_t numerator = (uint64_t)millis * (uint64_t)TX_TIMER_TICKS_PER_SECOND;
    uint64_t ticks = (numerator + (millisPerSec - 1)) / millisPerSec;
    return static_cast<T>(ticks);
}


//======================================================================================================================
// MARK: Thread Config
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief    Handle for Main thread.
/// \details  This structure contains the thread control block.
/// --------------------------------------------------------------------------------------------------------------------
TX_THREAD thrdHdl_Main;

/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Creates the Main Thread
/// \details    This function is called in App_ThreadX_Init() to create and configure the thread.
/// --------------------------------------------------------------------------------------------------------------------
void createThread_Main(VOID* ptrRtosMemoryPool)
{
    // Thread settings:
    TX_THREAD* thrdCtrlBlk = &thrdHdl_Main;          // Configure here the thread control block as handle to the thread. This must be declared in global area to use it e.g. in tx_thread_suspend. Use the pattern 'thrdHdl_[NameOfThread]'. Keep it short!
    CHAR thrdName[] = "thrd_Main";                   // Configure here a thread name. Use the pattern 'thrd_[NameOfThread]'. Keep it short!
    void (*thrdFctPtr)(ULONG param) = &thrdFct_Main; // Configure here the function name of the thread function. Use the pattern 'thrdFct_[NameOfThread]'. Keep it short!
    constexpr ULONG thrdParam = 0;                   // Configure here the parameter of the thread function.
    constexpr ULONG stackSize = 2 * 1024;            // Configure here the maximum size of the stack for this thread.
    constexpr UINT priority = 1;                     // Configure here initial thread priority (lower value = higher priority).
    constexpr UINT preemptionThreshold = priority;   // Configure here the preemption threshold (limits which threads can preempt this one).
    constexpr ULONG timeSlice = TX_NO_TIME_SLICE;    // Configure here the time slice value (TX_NO_TIME_SLICE = 0: disables time slicing for this thread).
    constexpr UINT autoStart = TX_AUTO_START;        // Configure here the auto-start option (thread starts automatically after creation).

    // Allocate the memory and get the stack pointer (ptrToStack):
    VOID* ptrToStack = nullptr; // This is needed for the following tx_thread_create() function.
    UINT result = tx_byte_allocate((TX_BYTE_POOL*)ptrRtosMemoryPool, &ptrToStack, stackSize, TX_NO_WAIT);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }

    // Create the Thread:
    result = tx_thread_create(thrdCtrlBlk, &thrdName[0], thrdFctPtr, thrdParam, ptrToStack, stackSize, priority, preemptionThreshold, timeSlice, autoStart);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }
}


/// --------------------------------------------------------------------------------------------------------------------
/// \brief    Handle for Background thread.
/// \details  This structure contains the thread control block.
/// --------------------------------------------------------------------------------------------------------------------
TX_THREAD thrdHdl_Background;


/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Creates the Background Thread
/// \details    This function is called in App_ThreadX_Init() to create and configure the thread.
/// --------------------------------------------------------------------------------------------------------------------
void createThread_Background(VOID* ptrRtosMemoryPool)
{
    // --- Thread settings:
    TX_THREAD* thrdCtrlBlk = &thrdHdl_Background;           // Configure here the thread control block as handle to the thread. This must be declared in global area to use it e.g. in tx_thread_suspend. Use the pattern 'thrdHdl_[NameOfThread]'. Keep it short!
    CHAR thrdName[] = "thrd_Background";                    // Configure here a thread name. Use the pattern 'thrd_[NameOfThread]'. Keep it short!
    void (*thrdFctPtr)(ULONG param) = &thrdFct_Background;  // Configure here the function name of the thread function. Use the pattern 'thrdFct_[NameOfThread]'. Keep it short!
    constexpr ULONG thrdParam = 0;                          // Configure here the parameter of the thread function.
    constexpr ULONG stackSize = 2 * 1024;                   // Configure here the maximum size of the stack for this thread.
    constexpr UINT priority = 31;                           // Configure here initial thread priority (lower value = higher priority).
    constexpr UINT preemptionThreshold = priority;          // Configure here the preemption threshold (limits which threads can preempt this one).
    constexpr ULONG timeSlice = TX_NO_TIME_SLICE;           // Configure here the time slice value (TX_NO_TIME_SLICE = 0: disables time slicing for this thread).
    constexpr UINT autoStart = TX_DONT_START;               // Configure here the auto-start option (TX_AUTO_START thread starts automatically after creation or TX_DONT_START thread don't start).

    // --- Allocate the memory:
    VOID* ptrToStack = nullptr;
    UINT result = tx_byte_allocate((TX_BYTE_POOL*)ptrRtosMemoryPool, &ptrToStack, stackSize, TX_NO_WAIT);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }

    // --- Create the Thread:
    result = tx_thread_create(thrdCtrlBlk, &thrdName[0], thrdFctPtr, thrdParam, ptrToStack, stackSize, priority, preemptionThreshold, timeSlice, autoStart);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }
}


