TimoEngelmann/nucleo-h753zi-threadx-demo/STM32Project/Application/application.cpp
//======================================================================================================================
// MARK: Event Flags Config
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief    Event Flag Group for Main timer.
/// \details  This struct holds the state of the event flags.
/// --------------------------------------------------------------------------------------------------------------------
TX_EVENT_FLAGS_GROUP evtFlags_Main;


/// --------------------------------------------------------------------------------------------------------------------
/// \brief    Event flag for Main thread wake-up.
/// \details  This defines the bit position of the event flag.
/// --------------------------------------------------------------------------------------------------------------------
constexpr uint32_t evtFlag_Main_WakeUp = 0x00000001;


/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Creates the event flags for main thread.
/// \details    This function is called in App_ThreadX_Init() to create and configure the event flags.
/// --------------------------------------------------------------------------------------------------------------------
void createEventFlags_Main()
{
    // --- Event Flags creation:
    TX_EVENT_FLAGS_GROUP* evtFlags = &evtFlags_Main; // Configure here the event flags group as handle to the event flags. This must be declared in global area to use it in application. Use the pattern 'evtFlags_[NameOfEventGroup]'. Keep it short!
    char evtGrpName[] = "evtGrp_Main";               // Configure here the name of the event group. Use the pattern 'evtGrp_[NameOfEventGroup]'. Keep it short!

    // Create the Event Flags Group:
    uint16_t result = tx_event_flags_create(evtFlags, &evtGrpName[0]);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }
}


//======================================================================================================================
// MARK: Timer Config
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief    Handle for Main timer.
/// \details  This structure contains the timer control block.
/// --------------------------------------------------------------------------------------------------------------------
TX_TIMER tmrHdl_Main;


/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Creates the timer for main thread.
/// \details    This function is called in App_ThreadX_Init() to create and configure the timer.
/// --------------------------------------------------------------------------------------------------------------------
void createTimer_Main()
{
    // --- Timer creation:
    TX_TIMER* tmrCtrlBlk = &tmrHdl_Main;                      // Configure here the timer control block as handle to the timer. This must be declared in global area to use it in application. Use the pattern 'tmrHdl_[NameOfTimer]'. Keep it short!
    CHAR tmrName[] = "tmr_Main";                              // Configure here the name of the timer. Use the pattern 'tmr_[NameOfTimer]'. Keep it short!
    VOID (*tmrFuncPtr)(ULONG tmrId) = tmrFct_MainThreadTimer; // Configure here the function name of the timer function. Use the pattern 'tmrFct_[NameOfTimer]'. Keep it short!
    const ULONG initialDelayInMillis = 10;                    // Configure here the initial duration for the first timer expiration.
    const ULONG rescheduleDurationInMillis = 10;              // Configure here the duration for all timer expirations after the first. A zero for this parameter makes the timer a one-shot timer.

    // Create the Timer:
    UINT result = tx_timer_create(tmrCtrlBlk, &tmrName[0], tmrFuncPtr, 0, millisToTicks<ULONG>(initialDelayInMillis), millisToTicks<ULONG>(rescheduleDurationInMillis), TX_AUTO_ACTIVATE);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }
}


//======================================================================================================================
// MARK: Callback Handler
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Callback function for handling stack overflow errors in a ThreadX thread.
/// \details    This function is called when a stack overflow is detected in a ThreadX thread.
///             It disables interrupts and end in an endless loop.
///             This should be replaced with a proper error handling mechanism.
/// --------------------------------------------------------------------------------------------------------------------
void stack_error_handler(TX_THREAD __attribute__((unused)) * thread)
{
    // Disable interrupts:
    UINT old_posture = tx_interrupt_control(TX_INT_DISABLE);

    // TODO: Replace it with an error handling mechanism!
    while (true)
    {
    };

    // Re-enable interrupts (but this will not happen, as the error handler enters an infinite loop):
    tx_interrupt_control(old_posture);
}


/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Callback function for initializing the ThreadX kernel.
/// \details    This function starts the ThreadX kernel by calling the `tx_kernel_enter` function.
///             It is the entry point for initializing the RTOS and should be called during system startup.
///             ATTENTION: This function is originally placed in the app_threadX.c file, generated by STM32CubeMX.
/// --------------------------------------------------------------------------------------------------------------------
void MX_ThreadX_Init()
{
    tx_kernel_enter();
}


