TimoEngelmann/nucleo-h753zi-threadx-demo/STM32Project/Application/application.cpp
/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Callback function for initializing the ThreadX application.
/// \details    This function sets up the necessary threads, timers, and error handlers for the ThreadX RTOS.
///             ATTENTION: This function is originally placed in the app_threadX.c file, generated by STM32CubeMX.
/// --------------------------------------------------------------------------------------------------------------------
UINT App_ThreadX_Init(VOID* memory_ptr)
{
    // --- Create threads and timers:
    createThread_Background(memory_ptr);
    //tx_thread_suspend(&thrdHdl_Background); // Suspend the background direct thread until it is resumed by the main thread.
    createThread_Main(memory_ptr);
    createEventFlags_Main();
    createTimer_Main();

    // Register the stack error handler
    UINT result = tx_thread_stack_error_notify(stack_error_handler);
    if (result != TX_SUCCESS)
    {
        // TODO: Replace it with an error handling mechanism!
        while (true)
        {
        };
    }

    // Return:
    return TX_SUCCESS;
}


//======================================================================================================================
// MARK: Timer Functions
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Timer function for the main thread.
/// \details    This function is called when the timer expires.
/// --------------------------------------------------------------------------------------------------------------------
void tmrFct_MainThreadTimer(ULONG __attribute__((unused)) timer_input)
{
    // Set an event flag to wake up the main thread for synchronized execution:
    tx_event_flags_set(&evtFlags_Main, evtFlag_Main_WakeUp, TX_OR);
}


//======================================================================================================================
// MARK: Thread Functions
//======================================================================================================================

/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Main thread function.
/// \details    This function implements the behavior of the main application thread.
///             It continuously waits for a timer event flag. After each event the application code is run once.
///             This results in a time-synchronized execution of the application code every [periodInMillsecs].
///             See configured in createTimer_Main().
/// --------------------------------------------------------------------------------------------------------------------
void thrdFct_Main(ULONG __attribute__((unused)) thread_input)
{
    // --- Init Application:
    // Place here initialization stuff that needs to be done before starting the threads.
    // Initialize LED1 (turn on at startup)
    HAL_GPIO_WritePin(LED1_Green_GPIO_Port, LED1_Green_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_Orange_GPIO_Port, LED2_Orange_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED3_Red_GPIO_Port, LED3_Red_Pin, GPIO_PIN_SET);

    // Start now the background thread:
    tx_thread_resume(&thrdHdl_Background);

    // Infinite loop:
    for (;;)
    {
        { // --- Main Application:
          // Place here the cyclic application stuff.
          // It runs every [periodInMillsecs] see configured in createTimer_Main().

            // Demo code to blink the LD1:
            counterMain1++;
            if (counterMain1 >= counterMain1Max)
            {
                counterMain1 = 0;
                counterLD1++;
                HAL_GPIO_TogglePin(LED1_Green_GPIO_Port, LED1_Green_Pin);
            }

            // Demo code to blink the LD2:
            counterMain2++;
            if (counterMain2 >= counterMain2Max)
            {
                counterMain2 = 0;
                counterLD2++;
                HAL_GPIO_TogglePin(LED2_Orange_GPIO_Port, LED2_Orange_Pin);
            }
        }

        // Wait for the next timer event flag:
        // This implements the time synchronized behavior of the main thread.
        ULONG receivedEvtFlags = 0;
        tx_event_flags_get(&evtFlags_Main, evtFlag_Main_WakeUp, TX_OR_CLEAR, &receivedEvtFlags, TX_WAIT_FOREVER);
    }
}


/// --------------------------------------------------------------------------------------------------------------------
/// \brief      Background thread function.
/// \details    This function implements the behavior of the background thread.
///             It continuously executes in an infinite loop with lowest priority (31) to use the free processing time.
/// --------------------------------------------------------------------------------------------------------------------
void thrdFct_Background(ULONG __attribute__((unused)) thread_input)
{    
    // Infinite loop:
    for (;;)
    {
        { // Background Application:
          // Place here the background stuff.

            // Increment demo counter:
            counterBackground++;

            // Check if button B1 is pressed (active high)
            // TODO: Insert debouncing.
            if (HAL_GPIO_ReadPin(Button1_Blue_GPIO_Port, Button1_Blue_Pin) == GPIO_PIN_SET)
            {
                if (HAL_GPIO_ReadPin(LED3_Red_GPIO_Port, LED3_Red_Pin) == GPIO_PIN_RESET)
                {
                    counterButton++;
                    counterLD3++;
                    buttonTimeStamps.push_back(counterBackground); // => clangd C++ include test.
                    HAL_GPIO_WritePin(LED3_Red_GPIO_Port, LED3_Red_Pin, GPIO_PIN_SET);
                }
            }
            else
            {
                HAL_GPIO_WritePin(LED3_Red_GPIO_Port, LED3_Red_Pin, GPIO_PIN_RESET);
            }
        }
    }
}
